/* Ο DELIMITER αφορά τους Διαχωριστές που είναι οι χαρακτήρες κενού (space ή tab) και το ελληνικό ερωτηματικό ;.
   Ο Λεκτικός Αναλυτής (ΛΑ) τους αγνοεί.
   ΚΕ: [ \t;]+
   Ορίζεται από τον αριθμό 1. */
#define DELIMITER 1

/* Το token IDENTIFIER αφορά τα Αναγνωριστικά που αποτελούνται από έναν ή περισσότερους κεφαλαίους ή/και πεζούς
   λατινικούς χαρακτήρες (a-z, A-Z), ή/και από το underscore _ και από τα ψηφία 0-9, εκτός από τον αρχικό χαρακτήρα.
   ΚΕ: [a-zA-Z]+((_+)*([0-9]+)*([a-zA-Z]+)*)*|_+((_+)*([0-9]+)*([a-zA-Z]+)*)*
   Ορίζεται από τον αριθμό 2. */
#define IDENTIFIER 2

/* Το token KEYWORD αφορά τις Λέξεις Κλειδιά που είναι όσες αναφέρονται στην παρακάτω Κανονική Έκφραση.
   ΚΕ: break|case|func|const|continue|double|do|else|float|for|if|int|long|return|short|sizeof|struct|switch|void|while
   Ορίζεται από τον αριθμό 3. */
#define KEYWORD 3

/* Το token STRING αφορά τα Λεκτικά Κυριολεκτικά που περικλείονται μέσα σε διπλές αποστρόφους (") και περιλαμβάνουν
   οποιονδήποτε χαρακτήρα εκτός του backslash \, της νέας γραμμής \n ή της διπλής αποστρόφου, τα οποία μπορούν να 
   γίνουν αποδεκτά με τη χρήση σειρών διαφυγής (\\, \n, \"). 
   ΚΕ: \"(([^\"\n\\])*(\\\")*(\\n)*(\\\\)*)*\"
   Ορίζεται από τον αριθμό 4. */
#define STRING 4

/* Το token INTEGER αφορά τους Ακέραιους Αριθμούς οι οποίοι περιλαμβάνουν δεκαδικούς, δεκαεξαδικούς και οκταδικούς
   ακεραίους. Ένας δεκαδικός ακέραιος ξεκινάει με μη μηδενικό ψηφίο (1-9) και μπορούν να ακολουθήσουν οποιαδήποτε 
   ψηφία 0-9. Το 0 είναι η μόνη εξαίρεση. Ένας δεκαεξαδικός ακέραιος ξεκινάει με 0x ή 0X και ακολουθούν οποιαδήποτε
   δεκαεξαδικά ψηφία (0-9, A-F). Ένας οκταδικός ακέραιος ξεκινάει με 0 και ακολουθούν ένα ή περισσότερα οκταδικά ψηφία 
   (0-7).
   ΚΕ: [1-9]([0-9]+)?|0[xX][a-fA-F0-9]+|0[0-7]*
   Ορίζεται από τον αριθμό 5. */
#define INTEGER 5

/* Το token FLOAT αφορά τους Αριθμούς Κινούμενης Υποδιαστολής οι οποίοι αποτελούνται το ακέραιο και το δεκαδικό μέρος
   που διαχωρίζονται με μία τελεία (.). Μπορεί να γίνει ορισμός δυνάμεων με τον χαρακτήρα 'e' ή 'E'. 
   ΚΕ: [0-9]+[eE]-?[0-9]+(\.[0-9]+)?|[0-9]+\.[0-9]+([eE]-?[0-9]+(\.[0-9]+)?)?
   Ορίζεται από τον αριθμό 6. */
#define FLOAT 6

/* Το token OPERATOR αφορά τους Τελεστές οι οποίοι κατηγοριοποιούνται ως εξής: αριθμητικοί, ανάθεσης, επαυξημένης 
   ανάθεσης, boolean λογικής, ελέγχου ισότητας, προσαύξησης και μείωσης κατά ένα, order relations, διεύθυνσης μνήμης. 
   ΚΕ: \+=|\+=|-=|\*=|\/=|\+\+|--|&&|\|\||\*|\+=|==|!=|<=|>=|\+|-|\/|%|=|!|<|>|&
   Ορίζεται από τον αριθμό 7. */
#define OPERATOR 7

/* Το COMMENT αφορά τα Σχόλια τα οποία χωρίζονται σε μίας γραμμής (// ... \n) και σε πολλών γραμμών (/* ... * /).
   Ο Λεκτικός Αναλυτής (ΛΑ) τα αγνοεί.
   ΚΕ: \/\/.*\n|\/\*(.*\n*)*?\*\/
   Ορίζεται από τον αριθμό 8. */
#define COMMENT 8

/* Το UNKNOWN_TOKEN είναι μία λεκτική μονάδα που δεν αναγνωρίζεται ως κάτι απο τα παραπάνω. 
   ΚΕ: [^ {DELIM}\n]+
   Ορίζεται από τον αριθμό 9. */
#define UNKNOWN_TOKEN 9