% Παράμετροι
fc = 100e3; % φέρουσα συχνότητα
fs = 1e6; % ρυθμός δειγματοληψίας
T = 3e-3; % διάρκεια bit
t = 0:1/fs:T-1/fs; % χρόνος
m = [1 0 1 0 0 0 1 1 1]; % σήμα πληροφορίας

% Δημιουργία σήματος πληροφορίας
mt = repelem(m, length(t));

% Δημιουργία διαμορφωμένου σήματος
s = cos(2*pi*fc*repmat(t,1,length(m)) + pi*mt);

% Γραφική αναπαράσταση στο πεδίο του χρόνου
figure;
subplot(2,1,1);
plot(mt);
title('Σήμα πληροφορίας');
xlabel('Χρόνος (s)');
ylabel('Τιμή');

subplot(2,1,2);
plot(s);
title('Διαμορφωμένο σήμα');
xlabel('Χρόνος (s)');
ylabel('Τιμή');

% Γραφική αναπαράσταση του φάσματος πλάτους
figure;
subplot(2,1,1);
plot(abs(fft(mt)));
title('Φάσμα πλάτους του σήματος πληροφορίας');
xlabel('Συχνότητα (Hz)');
ylabel('Πλάτος');

subplot(2,1,2);
plot(abs(fft(s)));
title('Φάσμα πλάτους του διαμορφωμένου σήματος');
xlabel('Συχνότητα (Hz)');
ylabel('Πλάτος');